#include <stdlib.h>
#include <stdio.h>
#include <pthread.h>

/*
- Почему переменную а можно делать локальной в примере 1?

  В примере 1 возвращалось значение переменной a, преобразованное в void *,
  В этом примере возвращается адрес переменной a
  если сделать a локальной, то после завершения any_func она перестанет
  существовать, а возвращенный указатель станет недействительным.
- Почему необходима двойная косьвенная адресация при передаче вещественного типа?
  Двойная косвенная адресация необходима не из-за вещественного типа double
  Она нужна потому, что pthread_join должна записать возвращенный потоком
  указатель в переменную основной функциип оток возвращает void *, а pthread_join принимает адрес переменной,
  в которую нужно записать этот void *. Поэтому pthread_join принимает void **
  pdata указывает на переменную pq
  *(double *)*pdata дает значение a.
*/

double a;

void *any_func(void *arg)
{
    // arg является нетипизированным указателем на переданные потоку данные
    printf("arg %p\n", arg);

    // преобразуем void * в double * и получаем переданное значение
    printf("*arg %f\n", *(double *)arg);

    //double a = *(double *)arg;
    // локальную a здесь использовать нельзя, если мы возвращаем ее адрес
    // после завершения any_func локальная переменная перестанет существовать
    a = *(double *)arg;

    // увеличиваем 2007 до 2008
    a++;

    printf("a %f\n", a);

    // pa хранит адрес глобальной переменной a
    double *pa = &a;

    // для %p указатель желательно явно преобразовать в void *
    printf("pa %p\n", (void *)pa);

    // разыменовываем pa и получаем значение переменной a
    printf("*pa %f\n", *pa);

    return pa; // возвращаем указатель
}

int main(void)
{
    // идентификатор создаваемого потока
    pthread_t thread;

    // данные, которые будут переданы дополнительному потоку
    double data = 2007;

    // нетипизированный указатель на переменную data
    void *pp = &data;

    // указатель pdata должен указывать на доступную память иначе может быть сегментация
    // pq является переменной, в которую pthread_join запишет результат потока
    void *pq = NULL;

    // pdata указывает на переменную-указатель pq
    // поэтому pdata имеет тип void **
    void **pdata = &pq; // = 0;

    // выводим адрес переменной data
    printf("pp %p\n", pp);

    // преобразуем pp в double * и получаем значение data
    printf(" * pp %f\n", *((double *)pp));

    if (pthread_create
    (
        // указатель на переменную, в которую будет записан идентификатор созданного потока
        &thread,

        // дополнительные параметры создаваемого потока
        NULL,

        // указатель на потоковую функцию
        &any_func,

        //нетипизированный указатель на параметры, передаваемые потоку
        pp
    )
    != 0
    )
    {
        fprintf(stderr, "Error\n");
        return 1;
    }

    // основной и дополнительный потоки могут выполняться одновременно
    printf("2 pp %p\n", pp);
    printf("2 * pp %f\n", *((double *)pp));

    pthread_join
    (
        // идентификатор потока
        thread,

        /*
        If retval is not NULL, then pthread_join() copies the exit status of
        the target thread (i.e., the value that the target thread supplied to
        pthread_exit(3)) into the location pointed to by retval. If the target
        thread was canceled, then PTHREAD_CANCELED is placed in the location
        pointed to by retval.
        */

        // нетипизированный указатель на копию! нетипизированного указателя с результатом работы потока
        // pthread_join запишет возвращенный any_func указатель в переменную pq
        pdata
    );

    //значение указателя на копию указателя
    // pdata содержит адрес переменной pq
    printf("pdata %p\n", (void *)pdata);

    // указатель на a
    // *pdata равно pq и содержит адрес глобальной переменной a
    printf("* pdata %p\n", *pdata);

    // значение a
    // сначала получаем *pdata, то есть адрес a
    // затем преобразуем его в double * и разыменовываем
    printf(" ** pdata %f\n", *(double *)*pdata);

    // увеличиваем глобальную переменную a с 2008 до 2009
    a++;

    printf(" ** pdata %f\n", *(double *)*pdata);

    return 0;
}