/* Создать программу, запускаемую на N терминалах, для обмена сообщениями между терминалами через файл.
 Каждый экземпляр программы, запущенный на каждом терминале содержит два процесса:
 один записывает файл, второй читает. Так на двух терминалах работает четыре процесса,
 обеспечивая двусторонний обмен. 
 Идентификатор пользователя (терминала), можно задавать параметром при запуске приложения.
 Предусмотреть хранение информации для отсутствующего получателя.
 Начать разработку со схемы данных. Предусмотреть поля для идентификаторов, отправителя и получателя,
а так же данных.
Разработать протокол обмена и структуру файла.
Продумать протокол очистки файла.
Исследовать вопрос с уникальностью идентификаторов.
*/
